import 'package:flutter/material.dart';
import 'package:my_app/About/AbFollow.dart';
import 'package:my_app/About/Post.dart';
import 'package:my_app/Setting/Setting.dart';
import 'package:my_app/UserPost.dart';

class About extends StatefulWidget {
  const About({super.key});
  @override
  State<About> createState() => _AboutState();
}

var click = false;
String name = "DALAPHONE ALIYA";

class _AboutState extends State<About> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: const Color(0xFF00abb3),
      extendBodyBehindAppBar: true,
      appBar: AppBar(
        backgroundColor: const Color(0xFF00abb3),
        centerTitle: true,
        elevation: 0,
        title: const Text(
          "ໂປຣໄຟລ໌",
          style: TextStyle(fontSize: 25),
        ),
      ),
      body: ListView(
        children: [
          Column(
            children: [
              Container(
                width: MediaQuery.of(context).size.width,
                height: 800,
                // margin: const EdgeInsets.only(top: 20),
                decoration: const BoxDecoration(
                    color: Color(0xFFffffff),
                    borderRadius: BorderRadius.only(
                        topLeft: Radius.circular(25.0),
                        topRight: Radius.circular(25.0))),
                child: Column(
                  children: [
                    Container(
                      height: 170,
                      width: 170,
                      margin: const EdgeInsets.only(top: 35),
                      decoration: BoxDecoration(
                          border: Border.all(
                              width: 3.0, color: const Color(0xFF00abb3)),
                          shape: BoxShape.circle),
                      child: const Padding(
                          padding: EdgeInsets.all(4.0),
                          child: CircleAvatar(
                            backgroundImage: AssetImage("asset/img/Dy.jpg"),
                          )),
                    ),
                    Container(
                      margin: const EdgeInsets.only(top: 15),
                      child: Text(
                        name,
                        style: TextStyle(fontSize: 18),
                        textAlign: TextAlign.center,
                      ),
                    ),
                    const SizedBox(
                      height: 20,
                    ),
                    Row(
                      mainAxisAlignment: MainAxisAlignment.center,
                      children: [
                        AbFollow("10", "Check in", 120, 18, 15),
                        Container(
                            decoration: const BoxDecoration(
                                // color: Colors.amber.shade200,
                                border: Border(
                                    right: BorderSide(
                                        width: 2.0, color: Colors.black26),
                                    left: BorderSide(
                                        width: 2.0, color: Colors.black26))),
                            child: AbFollow("170", "Followers", 120, 18, 15)),
                        AbFollow("64", "Following", 120, 18, 15),
                      ],
                    ),
                    const SizedBox(
                      height: 20,
                    ),
                    Row(
                      mainAxisAlignment: MainAxisAlignment.center,
                      children: [
                        InkWell(
                          onTap: () {
                            setState(() {
                              click = !click;
                            });
                          },
                          child: Container(
                            height: 28,
                            width: 107,
                            alignment: Alignment.center,
                            decoration: BoxDecoration(
                                border: Border.all(
                                    width: 1,
                                    color: click
                                        ? Color(0xFF6d6d6d)
                                        : Color(0xFF00abb3)),
                                color: click ? null : Color(0xFF00abb3),
                                borderRadius: BorderRadius.circular(8)),
                            child: Text(
                              click ? "ກຳລັງຕິດຕາມ" : "ຕິດຕາມ",
                              style: TextStyle(
                                  fontSize: 16,
                                  color: click
                                      ? Color(0xFF4f4c4c)
                                      : Color(0xFFffffff)),
                            ),
                          ),
                        ),
                        Container(
                          height: 28,
                          width: 107,
                          alignment: Alignment.center,
                          margin: const EdgeInsets.only(left: 8),
                          decoration: BoxDecoration(
                              border: Border.all(
                                  width: 1, color: Color(0xFF6d6d6d)),
                              borderRadius: BorderRadius.circular(8)),
                          child: const Text(
                            "ຂໍ້ຄວາມ",
                            style: TextStyle(
                                fontSize: 16,
                                // fontWeight: FontWeight.bold,
                                color: Color(0xFF4f4c4c)),
                          ),
                        ),
                      ],
                    ),
                    const SizedBox(
                      height: 20,
                    ),
                    Post(
                        "asset/img/Patusai_1.jpg",
                        "ປະຕູໄຊ",
                        "ປະ​ຕູ​ໄຊ​,ວຽງ​ຈັນ​​ປະຕູໄຊອີກ​ໜຶ່ງ​ສະຖານທີ່ຂອງ​ນະຄອນ​ຫຼວງ​ວຽງ​ຈັນ...",
                        "asset/img/Patusai_1.jpg",
                        "asset/img/Patusai_2.jpg",
                        "asset/img/Patusai_3.jpg",
                        "asset/img/Patusai_4.jpg",
                        "ປະ​ຕູ​ໄຊ​,ວຽງ​ຈັນ​​ປະຕູໄຊອີກ​ໜຶ່ງ​ສະຖານທີ່ຂອງ​ນະຄອນ​ຫຼວງ​ວຽງ​ຈັນ​ເປັນ​ອະນຸສອນ​ສະຖານ​ເພື່ອ​ລະ​ລຶກ​ເຖິງ​ປະຊາຊົນ​ຊາວ​ລາວ​ຜູ້​ເສຍ​ສະລະ​ຊີວິດ​ໃນ​ສົງຄາມ​ກ່ອນ​ໜ້າ​ການ​ປະຕິວັດ​ຂອງ​ພັກ​ຄອມ​ມິວ​ນິດ​​ບໍລິເວນ​​ອ້ອມ​ຮອບມີບ່ອນ",
                        "ຈອດລົດ​ຈັດການ​ສະແດງ​ນ້ຳ​ພຸ"
                            "​ປະກອບ​ດົນຕີ​ແລະສວນ​ປະ​ຕູ​ໄຊ,ອານຸສາວະລີປະຕູໄຊເຊິ່ງບາງຄົນກໍ່ມັກຮຽກສັ້ນໆວ່າປະຕູໄຊຫຼືບາງຄົນກໍ່ວ່າອານຸສາວະລີ.ແຕ່ຈະໃຫ້ຖືກແທ້ໆຕ້ອງເອີ້ນວ່າ:"
                            "ອານຸສາວະລີປະຕູໄຊ.ສິ່ງກໍ່ສ້າງນີ້ສ້າງເພື່ອເປັນອານຸສອນສະຖານແກ່ໄຊຊະນະຂອງສົງຄາມແລະເປັນສອນປະຕູໄຊມອານຸສາວະລີປະຕູໄຊເຊິ່ງບາງຄົນກໍ່ມັກຮຽກ"
                            "ສັ້ນໆວ່າປະຕູໄຊຫຼືບາງຄົນກໍ່ວ່າອານຸສາວະລີ.ແຕ່ຈະໃຫ້ຖືກແທ້ໆຕ້ອງເອີ້ນວ່າ:ອານຸສາວະລີປະຕູໄຊ.ສິ່ງກໍ່ສ້າງນີ້ສ້າງເພື່ອເປັນອານຸສອນສະຖານແກ່ໄຊຊະນະຂອງ",
                        "ສົງຄາມແລະເປັນອານຸສອນແກ່ທະຫານທີ່ຕາຍໃນສົງຄາມໂລກຄັ້ງທີສອງແລະສົງຄາມກັບຈັກກະພັດຝຣັ່ງໃນປີ1949,ປະຕູໄຊເລີ່ມການກໍ່ສ້າງໃນປີ1957ແລະສຳ"
                            "ເລັດການກໍ່ສ້າງໃນປີ1968ໂດຍນຳໃຊ້ທຶນຈາກອາເມລິກາທີ່ເບື້ອງຕົ້ນຈະເອົາໄປສ້າງເດີ່ນບິນໃນລະຫວ່າງສົງຄາມອິນດູຈີນແຕ່ກໍ່ຖືກນຳມາເຮັດອານຸສາວະລີລວມມູນ"
                            "ຄ່າການກໍ່ສ້າງປະມານ63ລ້ານກີບໃນຕອນນັ້ນແລະການອອກແບບໂດຍ ທ້າວ ທຳ ໄຊຍະສິດເສນາ.",
                        "ຈາກຮູບແບບການກໍ່ສ້າງແລ້ວ ຮູບຊົງແມ່ນຄ້າຍກັບ Arc de Triomphe ຢູ່ປະເທດຝຣັງ ແລະ ຫຼາຍຄົນກະວ່າແມ່ນ ອ້າຍນ້ອງກັນ,ແມ່ນວ່າຈະມີຮູບຊົງໂຄງສ້າງຄ້າຍກັນ ແຕ່ໃນເລື່ອງລວດລາຍ ",
                        "ແລະ ສະຖາປັດຕະຍະກຳແລ້ວ ປະຕູໄຊ ແມ່ນແຕ້ມແຕ່ງ ດ້ວຍລວດລາຍຂອງລາວ ເຊັ່ນວ່າ:"
                            " ຮູບຂອງກິນນາລີ, ຮູບກົບກິນເດືອນ ແລະ ອື່ນໆ. ອານຸສາວະລີ ປະຕູໄຊ ແມ່ນຈະມີປະຕູໃຫຍ່ທັງສີ່ດ້ານ ແລະ ປະກອບມີ 7 ຊັ້ນ, ມີຂັ້ນໄດທາງ ຂຶ້ນ ສອງຂ້າງ, "
                            "ໂດຍທາງດ້ານເທິງ ເປັນອາຄານ 5 ຍອດ ຕາມຫຼັກການປົກຄອງປະເທດເຮົາ ແບບພຸດທະສາສະໜາ ໄດ້ແກ່: ພັນທະມິດ, ການໃຫ້ອະໄພ, ຄວາມສື່ສັດ, ການໃຫ້ກຽດ "
                            "ແລະ ຄວາມຈະເລີນຮຸ່ງເຮືອງ, ຖ້າຂຶ້ນໄປຮອດຍອດຂອງອາ ນຸສາວະລີ ທ່ານກໍ່ຈະໄດ້ຊື່ມຊົມກັບທິວທັດຄວາມງົດງາມ  ຂອງຕົວເມືອງວຽງຈັນ."
                            "ປະຕູໄຊຖືກອ້ອມຮອບໄປດ້ວຍສວນສາທາລະນະ ແລະ ຫົນທາງສາຍຫຼັກທີ່ມີລັກສະນະເປັນວົງວຽນ ແລະ ຫົນທາງເສັ້ນໃຫຍ່, ທາງດ້ານໜ້າ "
                            "ຂອງປະຕູໄຊມີນໍ້າພຸທີ່ສວຍງາມ, ມີສວນສາທາລະນະ ໃຫ້ຜັກຜ່ອນຍ່ອນໃຈ, ເປັນບ່ອນທີ່ຊາວວຽງຈັນ ມັກມາຜັກຜ່ອນ, ສູດອາກາດບໍລິສຸດ ແລະ "
                            "ອອກກຳລັງກາຍ."
                            "ຄ່າ​ເຂົ້າ​ຊົມ​: 10,000 ກີບ​ ເວລາ​ເປີດ​-ປິດ​: 8.00 - 17.00 ນ"),
                    Post(
                        "asset/img/TadKvangSe_1.jpg",
                        "ຕາດກວ້າງຊີ",
                        "ນໍ້າຕົກຕາດກວາງຊີຕັ້ງຢູ່ເຂດບ້ານທ່າແປ້ນຫ່າງຈາກຕົວເມືອງປະມານ 25 ກິໂລ...",
                        "asset/img/TadKvangSe_1.jpg",
                        "asset/img/TadKvangSe_2.jpg",
                        "asset/img/TadKvangSe_3.jpg",
                        "asset/img/TadKvangSe_4.jpg",
                        "ນໍ້າຕົກຕາດກວາງຊີ ຕັ້ງຢູ່ເຂດບ້ານທ່າແປ້ນຫ່າງຈາກຕົວເມືອງປະມານ 25 ກິໂລແມັດ. ຕາດນີ້ເປັນນໍ້າຕົກຕາດຫີນປູນເຊິ່ງມີຄວາມສູງປະມານ 80 "
                            "ແມັດຫຼຸດລົງມາເປັນຊັ້ນໆ ໂດຍນ້ຳ​ຕົກ​ແລະ​ແອ່ງ​ນ້ຳ​ສີ​ຂຽວ​ມໍລະ​ກົດ​ຖືກ​​ປ່າໄມ້ທີ່ອຸດົມສົມບູນອ້ອມຮອບ.",
                        "​ຄວາມສວຍສົດງົດງາມຂອງນໍ້າຕົກຕາດທີ່ມີສີຂຽວມໍລະກົດ"
                            "ບວກກັບປ່າໄມ້ຂຽວອຸ່ມທຸ່ມໄດ້ສ້າງຄວາມປະທັບໃຈໃຫ້ແກ່ຜູ້ທີ່ມາຢ້ຽມຢາມນໍ້າຕົກຕາດແຫ່ງແຫ່ງນີ້. ແຫ່ງ​ນີ້​ເປັນ​ອີກ​ໜຶ່ງ​ສະຖານ​ທີ່​ທ່ອງ​ທ່ຽວ​ທາງ​ທຳມະຊາດ​ຢອດ​ນິຍົມ​ຂອງ​ຫຼວງ​ພະ​ບາງ​ "
                            "ເຊິ່ງໃຊ້​ເວລາ​ເດິນທາງ​ເຂົ້າ​ສູ່ນ້ຳ​ຕົກ​ຕາດ​ກວາງ​ຊີ​ປະມານ​"
                            "45 ນາ​ທີ​ບ່ອນນີ້​ມີ​ກິດຈະກຳ​ໃຫ້​ເຮັດ​ຫຼາຍ​ຢ່າງ​ ໃຜ​ຢາກ​ລົງ​ຫລິ້ນ​ນ້ຳ​ກໍ​ມີ​ຫ້ອງ​ປ່ຽນ​ເສື້ອ​ຜ້າ​ໃຫ້​ບໍລິການ​ບໍລິເວນ​ດ້ານ​ລຸມ​ນ້ຳ​ຕົກ​ມີ​ຂົວ​ແລະ​ເສັ້ນ​ທາງເດີນ​ຊົມ​ວິວ​ອີກ​ດ້ວຍຢູ່ຕາມທາງຍ່າງເຂົ້າໄປ"
                            "ເບື້ອງຂວາກ່ອນຈະຮອດຕົວຕາດ",
                        " ຈະໄດ້ພົບກັບວັງນໍ້າສີຂຽວງາມຫຼາຍວັງ ແລະ ມີບາງວັງທີ່ສາມາດລົງຫຼິ້ນໄດ້ ເຊິ່ງຈະສ້າງຄວາມຮູ້ສຶກສົດຊື່ນເຢັນສະບາຍ ແລະ ສໍາຜັດໄດ້ເຖິງທໍາມະຊາດແທ້ໆ."
                            "ນອກຈາກນັ້ນແລ້ວ ຖ້າທ່ານໃດມັກຮັກການປະຈົນໄພ ແລະ ຄວາມແປກໃໝ່, ທ່ານສາມາດເດີນທາງມາຕາດກວາງຊີໄດ້ ໂດຍການຍ່າງປ່າຕາມເສັ້ນທາງຍ່າງ ເລີ່ມຈາກເຂດບ້ານລ້ອງເລົາໄປຫາບໍລິເວນນໍ້າຕົກຕາດກວາງຊີ ໂດຍໃຊ້ເວລາປະມານ 3-4 ຊົ່ວໂມງ.",
                        " ການຍ່າງປ່າດັ່ງກ່າວເປັນກິດຈະກໍາໜຶ່ງຂອງການທ່ອງທ່ຽວແບບອະນຸຮັກປະຊາຊົນມີສ່ວນຮ່ວມເຊິ່ງທ່ານຈະໄດ້ເຫັນວິຖີຊີວິດຂອງຊົນເຜົ່າມົ້ງ ພ້ອມທັງຄວາມງົດງາມຂອງທໍາມະຊາດຕາມເສັ້ນ ",
                        "ທາງກ່ອນຈະຮອດຕາດກວາງຊີອີກດ້ວຍ. ຄ່າ​ເຂົ້າ​ຊົມ​: 20,000 ກີບ​ ເວລາ​ເປີດ​-ປິດ​: 6.00 - 17.30 ນ."),
                    Post(
                        "asset/img/Thampukham_1.jpg",
                        "ຖ້ຳປູຄຳ",
                        "ຖ້ຳປູຄຳຕັ້ງຢູ່ ບ້ານນາທອງ,ເມຶອງວັງວຽງ,ແຂວງວຽງຈັນເຊິ່ງຫ່າງຈາກເທດ...",
                        "asset/img/Thampukham_1.jpg",
                        "asset/img/Thampukham_2.jpg",
                        "asset/img/Thampukham_3.jpg",
                        "asset/img/Thampukham_4.jpg",
                        "ຖ້ຳປູຄຳຕັ້ງຢູ່ ບ້ານນາທອງ , ເມຶອງວັງວຽງ , ແຂວງວຽງຈັນ ເຊິ່ງຫ່າງຈາກເທດສະບານເມືອງວັງວຽງ 3,5 ກິໂລແມັດປະຫວັດຄວາມເປັນມາ"
                            " ເຊິ່ງ​ພົບເຫັນຈາກການສຳຫຼວດຂອງປະຊາຊົນທ້ອງຖິ່ນແລ້ວແມ່ນພົບເຫັນປາກຖ້ຳທີ່ຫ່າງຈາກ ",
                        "ໜ້າດິນປະມານ100 ແມັດຈະມີຮູເຂົ້ານ້ອຍໆ ແລະ ເຂົ້າໄປທາງໃນຈະເປັນຜົ້ງກວ້າງຂວາງ, ມີພະນອນ 1 ອົງ ແລະໄດ້ກ່າວກັນວ່າ ມີປູຄຳຄູ່ 1 ອາໄສຢູ່ໃນຖໍ້າ"
                            " ແລະຫຼັງຈາກນັ້ນກໍ່ໄດ້ເອີ້ນຖໍ້ານັ້ນວ່າ ຖໍ້າປູຄໍາ, (ຖ້າໃຜໂຊກດີແມ່ນຈະໄດ້ພົບເຫັນປູຄຳນັ້ນ) ຢູ່ຕີນຜາທາງລຸ່ມ ແມ່ນ ມີຫ້ວຍນ້ຳໃສເຢັນ"
                            " ທີ່ໄຫຼອອກມາຈາກຮູຜານັ້ນ ແລະ ເມື່ອນ້ຳກະທົບໃສ່ແສງແດດສີຂອງນ້ຳກໍ່ຈະກາຍເປັນສີຟ້າທີ່ມີຄວາມສວຍສົດງົດງາມຫຼາຍ"
                            "ສາມາດເດີນທາງໄປໄດ້ດ້ວຍລົດ ຫຼືການຍ່າງ . ເຊິ່ງນັກທ້ອງທ່ຽວສວ່ນຫຼາຍແມ່ນຈະເດີນທາງໄປດ້ວຍລົດຕຸກໆນຳທ່ຽວ ແລະ ",
                        "ການເດີນທາງໄປເສັ້ນທາງນີ້ກໍຖືວ່າມີຄວາມສະດວກສະບາຍຫຼາຍໃນປັດຈຸບັນ ຖ້າ ທຽບໃສ່ເມື່ອກ່ອນ ເພາະມີການປົວແປງເສັ້ນທາງຄືນໃໝ່ໃຫ້ມີເສັ້ນທາງປູຢາງໄປເຖິງຖ້ຳ,"
                            " ການເດີນທາງໄປແມ່ນຜ່ານຂົວຂ້າມແມ່ນ້ຳຊອງ , ຜ່ານທົ່ງນາ ແລະ ບ້ານເຮືອນຂອງປະຊາຊົນ. ຈະປະກົດເຫັນວິວທິວທັດທີ່ສວຍງາມ ແລະ ວິຖີການດຳລົງຊີວິດຂອງປະຊາຊົນເຂດນັ້ນໆ"
                            "ນອກຈາກຈະມີສະຖານທີ່ທາງທຳມະຊາດທີ່ສວຍງາມແລ້ວຖ້ຳປູຄຳຍັງມີຮ້ານອາຫານ,ຕູບ,ໂຕະ,ຕັ່ງຕ່າງໆໄວ້ຄອຍບໍລິການນັກທ້ອງທ່ຽວ ",
                        "ເຊິ່ງການບໍລິການດ້ານຕ່າງໆແມ່ນມາຈາກປະຊາຊົນທ້ອງຖິ່ນເປັນສວ່ນໃຫ່ຍເຊິ່ງຈັດຕັ້ງກັນເປັນໜ່ວຍໄວ້ຄອຍບໍລິການນັກທ້ອງທ່ຽວ,"
                            "ພ້ອມກັນນີ້ຍັງມີການອຳນວຍຄວາມສະດວກທາງ",
                        "ດ້ານສຸຂະອານາໄມ ເຊັ່ນ ມີຫ້ອງນ້ຳບໍລິການທີ່ສະອາດໄວ້ຄອຍບໍລິການນັກທ້ອງທ່ຽວ ແລະ"
                            "ຍັງມີອຸປະກອນອຳນວຍຄວາມສະດວກໃຫ້ເຊົ່າ ເຊັ່ນໂຄມໄຟ ແມ່ນໃຊ້ໃນເວລາຂຶ້ນຊົມຖໍ້າ, ເສື້ອຊູຊີບແລະກົງເບັງແມ່ນໃຊ້ເວລາລົງຫຼິ້ນນ້ຳ"
                            "ນອກຈາກນີ້ຍັງມີການບໍລິການສຳລັບນັກທ້ອງທ່ຽວທີ່ມັກຄວາມທ້າທາຍແລະຢາກທ່ຽວຊົມຮູບພາບທຳມະຊາດຈາກທີ່ສູງເຊັ່ນ ການບໍລິການສະລິງລອຍຟ້າ"
                            "ລາຍລະອຽດທາງດ້ານລາຄາຂອງການໃຊ້ບໍລິການຕ່າງໆມີຄື:ຄ່າເຂົ້າຊົມຖໍ້າ 10,000 ກີບ / 1ຄົນ,ຄ່າຈອດລົດໃຫ່ຍ 10,000 ກີບ / 1 ຄັນ,ຄ່າຈອດລົດຈັກ 3,000 ກີບ / 1ຄັນ"
                            ",ຄ່າຫ້ອງນ້ຳບໍລິການ 2,000ກີບ / 1ຄັ້ງ,ຄ່າເຊົ່າໂຄມໄຟແລະອຸປະກອນຕ່າງໆ 10,000 ກີບ / 1ຢ່າງ"),
                  ],
                ),
              ),
            ],
          ),
        ],
      ),
      floatingActionButton: FloatingActionButton(
        onPressed: () {
          Navigator.push(
              context, MaterialPageRoute(builder: (context) => UserPost()));
        },
        backgroundColor: Color(0xFF00abb3),
        child: const Icon(Icons.add),
      ),
    );
  }
}
